IDEA StatiCa Open Model
RigidLink.RigidZ Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 DOF rigid in Z dirrection
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public bool RigidZ { get; set; }
Public Property RigidZ As Boolean
	Get
	Set
public:
property bool RigidZ {
	bool get ();
	void set (bool value);
}
Property Value
Type: Boolean
See Also
Reference
RigidLink Class
IdeaRS.OpenModel.Model Namespace